/* Description for Update button when no iPod selected */
"UPDATE_NO_SELECTION" = "Päivitä iPod osoittamalla Päivitä.";
"UPDATE_NO_SELECTION_MULTIPLE" = "Päivitä iPodin firmware valitsemalla se.";
"UPDATE_ONE_SELECTION" = "Päivitä %@ versioon %@ osoittamalla Päivitä.";
"UPDATE_MULTIPLE_SELECTION" = "Päivitä valitut iPodit osoittamalla Päivitä.";
"UPDATE_MULTIPLE_SELECTION_DISALLOWED" = "Päivitä iPod osoittamalla Päivitä.";
"UPDATE_NO_UPDATES_AVAILABLE_SINGLE" = "iPod on ajan tasalla.";
"UPDATE_NO_UPDATES_AVAILABLE_MULTIPLE" = "Valitut iPodit ovat ajan tasalla.";
"UPDATE_NO_UPDATES_UNKNOWN_POD" = "Tämä päivittäjä ei tue valittua iPodia.";
"UPDATE_NO_UPDATE_WRONG_DISK_FORMAT" = "Vain Macintosh-muotoon alustetut iPodit voidaan päivittää.";

/* Description for Restore button when no iPod selected */
"RESTORE_NO_SELECTION" = "Jos haluat palauttaa iPodiin tehdasasetukset, osoita Palauta.";
"RESTORE_NO_SELECTION_MULTIPLE" = "Valitse iPod, johon palautetaan tehdasasetukset.";
"RESTORE_ONE_SELECTION" = "Jos haluat palauttaa iPodiin tehdasasetukset, osoita Palauta.";
"RESTORE_MULTIPLE_SELECTION" = "Palauta valittujen iPodien tehdasasetukset osoittamalla Palauta.";
"RESTORE_MULTIPLE_SELECTION_DISALLOWED" = "Jos haluat palauttaa iPodiin tehdasasetukset, osoita Palauta.";
"RESTORE_NOT_MOUNTED_YET" = "Odotetaan, että iPod tulee valmiiksi.";
"RESTORE_ONLY_OVER_FIREWIRE" = "Voit palauttaa tämän iPodin vain liittämällä sen FireWiren avulla.";

"UPDATING_STATUS" = "Päivitetään %@";

/* Strings for the Restore confirmation sheet */
"RESTORE_ALERT_SHEET_TITLE" = "Palautuksen vahvistus";
"RESTORE_ALERT_SHEET_DESC" = "Haluatko varmasti palauttaa iPodin tehdasasetukset? Kaikki siinä olevat kappaleet ja tiedot menetetään.";

/* Strings to show user when no iPods detected */
"PLUG_IN_IPOD" = "Liitä iPod päivitystä varten.";
"IPOD_RESTARTING_RESTORE" = "iPod on palautettu tehdasasetuksiin, ja se käynnistyy uudestaan. Anna iPodin olla liitettynä tietokoneeseen ja odota, kunnes palautusprosessi on suoritettu loppuun.";
"IPOD_RESTARTING_UPDATE" = "iPodin ohjelmisto on päivitetty, ja iPod käynnistyy uudelleen. Anna iPodin olla liitettynä tietokoneeseen ja odota, kunnes päivitysprosessi on suoritettu loppuun.";
"IPOD_RESTARTING_UNPLUG_REPLUG_RESTORE" = "iPod on palautettu tehdasasetuksiin. Irrota sen kaapeli ja liitä se sitten uudelleen, jotta palautus voidaan suorittaa loppuun.";
"IPOD_RESTARTING_UNPLUG_REPLUG_UPDATE" = "iPod on päivitetty. Irrota se ja liitä uudelleen päivityksen saattamiseksi loppuun.";
"IPOD_RESTARTING_UNPLUG_POWER_RESTORE" = "iPod on palautettu tehdasasetuksiinsa. Viimeistele palautusprosessi irrottamalla iPod ja liittämällä se ulkoiseen virtalähteeseen.";
"IPOD_RESTARTING_UNPLUG_POWER_UPDATE" = "iPod on päivitetty. Viimeistele päivitysprosessi irrottamalla iPod ja liittämällä se ulkoiseen virtalähteeseen.";
"TOO_MANY_IPODS" = "Liitettynä on useampi kuin yksi iPod. Päivitä yksi iPod kerrallaan. Poista muut iPodit näkyvistä Finderin avulla ja irrota ne tietokoneesta.";
/* "TOO_MANY_IPODS" = "There are way too many iPods plugged in. Please attach one iPod at a time to be updated. Eject other iPods using the Finder and disconnect them."; */

/* Field titles used when copying iPod details to clipboard */
"COPY_POD_NAME" = "Nimi";
"COPY_FIRMWARE_VERSION" = "Firmwaren versio";
"COPY_SERIAL_NUMBER" = "Sarjanumero";
"COPY_DISK_FORMAT" = "Levymuoto";
"COPY_CAPACITY" = "Tallennustila";
"COPY_POD_FAMILY" = "iPod-perhe";
"COPY_UPDATER_FAMILY" = "Päivittäjän perhe";

/* Name of iPod while it is still mounting */
"MOUNTING_NAME" = "(Tuodaan näkyviin)";
"UNMOUNTED_NAME" = "(Ei näkyvissä)";
"RESTORING_NAME" = "(Palautetaan)";
"UPDATING_NAME" = "(Päivitetään)";
"RESTARTING_NAME" = "(Käynnistyy uudelleen)";
"IPOD_NAME" = "iPod";

/* Status strings */
"RESTORING_STATUS" = "Palautetaan %@";
"UPDATING_STATUS" = "Päivitetään %@";
"RESTARTING_STATUS" = "Käynnistetään uudelleen";
"EXAMINING_STATUS" = "Tutkitaan iPodia";
"UNMOUNTING_STATUS" = "Poistetaan iPodia näkyvistä";
"PREPARING_STATUS" = "Valmistellaan iPodia";
"FINISHING_STATUS" = "Viimeistellään";
"FORMATTING_STATUS" = "Alustetaan iPodia";
"WRITING_FIRMWARE_STATUS" = "Kirjoitetaan iPod-ohjelmistoa";
"CLEARING_STATUS" = "Poistetaan vanhaa iPod-ohjelmistoa";
"WRITING_ICON_STATUS" = "Kirjoitetaan taltion symbolia";

/* Displayed for many of the info fields when multiple iPods are selected. */
"MULTIPLE_SELECTED" = "Valittuna on useita iPodeja.";
/* Displayed for many of the info fields when no iPods are selected. */
"NONE_SELECTED" = "Yhtään iPodia ei ole valittuna.";
/* Displayed when info is not available */
"UNKNOWN" = "Tuntematon";

/* Button titles */
"RESTORE" = "Palauta";
"CANCEL" = "Kumoa";
"OK" = "OK";

/* Errors */
"ERROR_TITLE" = "Virhe";
"CANT_UNMOUNT" = "iPodia ei voida poistaa näkyvistä, koska se on käytössä. Sulje kaikki iPodin auki olevat tiedostot ja yritä uudelleen.";
"CANT_MOUNT" = "Yksi iPod havaittiin, mutta sen on oltava näkyvissä työpöydällä, jotta toiminto voidaan suorittaa.";
"GENERAL_ERROR" = "Päivitettäessä tai palautettaessa iPodia tapahtui virhe.";
"SIGMATEL_ERROR" = "iPodia päivitettäessä tai palautettaessa tapahtui virhe. Irrota iPod ja liitä uudelleen, ja yritä palautusta uudestaan. Jos tämä ei auta, katso tietoja osoitteesta: http://www.apple.com/fi/support/ipod";
"CANT_FIND_FORMAT_SLICE" = "Dataosiota ei löytynyt eikä voitu alustaa. Irrota iPod ja liitä uudelleen, ja kokeile palautusta uudestaan.";
"FORMAT_ERROR" = "iPodia alustettaessa tapahtui virhe.";
"FORMAT_ERROR_Q14_USB" = "iPodia alustettaessa tapahtui virhe. Liitä iPod FireWiren avulla ja yritä uudelleen.";

/* sizes */
"GB" = "%.2f Gt";
"MB" = "%.2f Mt";			
"KB" = "%.2f Kt";

/* disk formats */
"DISK_FORMAT_HFS" = "Macintosh";
"DISK_FORMAT_FAT" = "Windows";
"DISK_FORMAT_UNKNOWN" = "Tuntematon";

/* Debug menu strings */
"DEBUG_MENU_TITLE" = "Debug";
"DEBUG_ALWAYS_ALLOW_UPDATES" = "Salli päivitykset aina";

/* strings for the quit sheet */
"QUIT_QUESTION_UPDATE_MESSAGE" = "iPod on päivitetty ja käynnistyy uudelleen. Jätä iPod kiinni tietokoneeseen ja odota, että se viimeistelee päivitysprosessin. Haluatko sulkea iPod-päivittäjän ja avata iTunesin?";
"QUIT_QUESTION_RESTORE_MESSAGE" = "iPod on palautettu ja käynnistyy uudelleen. Jätä iPod kiinni tietokoneeseen ja odota, että se viimeistelee palautusprosessin. Haluatko sulkea iPod-päivittäjän ja avata iTunesin?";
"QUIT_QUESTION_POWER_UPDATE_MESSAGE" = "iPod on päivitetty. Viimeistele päivitysprosessi irrottamalla iPod ja liittämällä se ulkoiseen virtalähteeseen. Haluatko sulkea iPod-päivittäjän ja avata iTunesin?";
"QUIT_QUESTION_POWER_RESTORE_MESSAGE" = "iPod on palautettu. Viimeistele päivitysprosessi irrottamalla iPod ja liittämällä se ulkoiseen virtalähteeseen. Haluatko sulkea iPod-päivittäjän ja avata iTunesin?";
"QUIT_QUESTION_UNPLUG_REPLUG_UPDATE_MESSAGE" = "iPod on päivitetty. Viimeistele päivitysprosessi irrottamalla iPod ja liittämällä se takaisin tietokoneeseen. Haluatko sulkea iPod-päivittäjän ja avata iTunesin?";
"QUIT_QUESTION_UNPLUG_REPLUG_RESTORE_MESSAGE" = "iPod on palautettu. Viimeistele päivitysprosessi irrottamalla iPod ja liittämällä se takaisin tietokoneeseen. Haluatko sulkea iPod-päivittäjän ja avata iTunesin?";

/* URLs */
"SUPPORT_URL" = "http://www.apple.com/fi/support/ipod";
"REGISTRATION_URL" = "http://www.apple.com/register";